swe-modified-2025/openfoam/example_4_1_2d_dam_break/perfect_slip/dambreak_Ny640/system/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 8;

method          simple;

simpleCoeffs
{
    n           (8 1 1);
    delta       0.001;
}

distributed     no;

roots           ();
